_Rarzrabotki/Rarus/USO2/InformationRegisters/СМ_ОтветственныеЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>СМ_ОтветственныеЛица</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/СМ_ОтветственныеЛица/Forms/ОтветственныеЗаМатериалы/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"Организация",Параметры.Организация,ВидСравненияКомпоновкиДанных.Равно);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия="УстановкаДатыОкончанияОтветственных" Тогда
		Элементы.Список.Обновить();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПередУдалением(Элемент, Отказ)
	Отказ=Истина;
	СписокПередУдалениемНаСервере(Новый Структура("Организация,Пользователь,ДатаНачала",Список.Отбор.Элементы[0].ПравоеЗначение,Элемент.ТекущиеДанные.Пользователь,Элемент.ТекущиеДанные.ДатаНачала));
	Оповестить("УстановкаДатыОкончанияОтветственных");
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СписокПередУдалениемНаСервере(СтруктураДляПередачи)
	РегистрыСведений.СМ_ОтветственныеЛица.ЗаписатьДатуОкончания(СтруктураДляПередачи);
КонецПроцедуры

#КонецОбласти
